000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОчередьОтказанныхСообщений/ОчередьОтказанныхСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьОтказанныхСообщений</name>
  <resources>
    <name>ДанныеСообщения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеОтказа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>УзелПолучатель</name>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Индекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаВыдачиПаспорта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КемВыданПаспорт</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПаспорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСотрудника</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>CatalogRef.ОбособленныеПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Уволен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОчередьОтказанныхСообщений/Forms/ФормаЗаписи/Module.bsl
&НаСервере	//	LNK 31.07.2018 14:37:24
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.СоздатьНовыйЭлемент.Доступность = (Запись.ТипОтправителя = "Справочник.ФизическиеЛица");

	Если ПустаяСтрока(АдресХранилищаВнешнихДанных) Тогда

		АдресХранилищаВнешнихДанных = ПоместитьВоВременноеХранилище(Новый Структура, УникальныйИдентификатор);

	КонецЕсли;
	
	СоответствиеОбъектов.Параметры.УстановитьЗначениеПараметра("УникальныйИдентификаторПриемника",Запись.Идентификатор);

КонецПроцедуры

&НаСервере	//	LNK 31.07.2018 15:21:45
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ДанныеСообщения = ТекущийОбъект.ДанныеСообщения.Получить();

	Если ТипЗнч(ДанныеСообщения) = Тип("Структура") И ДанныеСообщения.Свойство("Данные") Тогда

		ВнешниеДанные = ДанныеСообщения.Данные;
		ВнешниеДанные.Вставить("Идентификатор", Новый УникальныйИдентификатор(ДанныеСообщения.Идентификатор));

		Если ВнешниеДанные.Свойство("Пол") И ТипЗнч("Пол") = Тип("Строка") Тогда

			ВнешниеДанные.Пол = ОбщегоНазначенияКлиентСервер.ЗначениеПеречисления(Перечисления.ПолФизическогоЛица, ВнешниеДанные.Пол);

		КонецЕсли;

	//	Сериализуем в строку JSON так, как в составе имеется ТаблицаЗначений.. на тонком клиенте нет такого типа!
		АдресХранилищаВнешнихДанных = ПоместитьВоВременноеХранилище(ОбщегоНазначенияКлиентСервер.СериализоватьJSON(ВнешниеДанные), УникальныйИдентификатор);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте	//	LNK 31.07.2018 14:37:18
Процедура СоздатьНовыйЭлемент(Команда)

	ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьНовыйЭлементЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения
		, "Будет создан новый элемент типа «" + Запись.ТипОтправителя + "»!" + Символы.ПС
		+ "Подтвердите своё решение:"
		, РежимДиалогаВопрос.ОКОтмена, 60
		, КодВозвратаДиалога.ОК
		, "Требуется подтверждение"
		, КодВозвратаДиалога.Отмена
	);

КонецПроцедуры

&НаКлиенте	//	LNK 31.07.2018 14:38:40
Процедура СоздатьНовыйЭлементЗавершение(КодВозврата, ДополнительныеПараметры)	Экспорт

	Если КодВозврата = КодВозвратаДиалога.ОК Тогда

		ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьНовыйЭлементЗакрытиеФормы", ЭтотОбъект);

		ПараметрыФормы = Новый Структура("ЗначенияЗаполненияJSON", ПолучитьИзВременногоХранилища(АдресХранилищаВнешнихДанных));
		ОткрытьФорму("Справочник.ФизическиеЛица.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект, ЭтотОбъект,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

	Иначе

		ПоказатьОповещениеПользователя("Не выполнено!",, "Воздействие прервано пользователем", БиблиотекаКартинок.Ошибка32);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте	//	LNK 01.08.2018 11:10:46
Процедура СоздатьНовыйЭлементЗакрытиеФормы(Значение, ДополнительныеПараметры)	Экспорт

	Перем Выполнено;

	Если ТипЗнч(Значение) = Тип("Структура") Тогда

		Если Значение.Свойство("Выполнено", Выполнено) И Выполнено = Истина Тогда

			УдалитьТекущуюЗапись();

			Модифицированность = Ложь;
			Закрыть();

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаСервере	//	LNK 01.08.2018 12:52:43
Процедура УдалитьТекущуюЗапись()

	ЗаписьОбъект = РеквизитФормыВЗначение("Запись");
	ЗаписьОбъект.Удалить();

КонецПроцедуры // УдалитьТекущуюЗапись()
